In [1]:
import pandas as pd

In [2]:
pd.read_excel("maas.xlsx")

  Unnamed: 0  Maas   Yas Departman
0       atil   100  37.0   yazilim
1     zeynep   140  19.0     satis
2     mehmet   180  56.0       NaN
3        ali   220  59.0      arge
4       veli   260   NaN    finans
5        nur   300  35.0     hukuk

In [3]:
dataFrame = pd.read_excel("maas.xlsx")

In [4]:
dataFrame

  Unnamed: 0  Maas   Yas Departman
0       atil   100  37.0   yazilim
1     zeynep   140  19.0     satis
2     mehmet   180  56.0       NaN
3        ali   220  59.0      arge
4       veli   260   NaN    finans
5        nur   300  35.0     hukuk

In [7]:
doluDegerlerDataFrame = dataFrame.dropna()

In [8]:
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas Departman
0       atil   100  37.0   yazilim
1     zeynep   140  19.0     satis
3        ali   220  59.0      arge
5        nur   300  35.0     hukuk

In [9]:
doluDegerlerDataFrame.to_excel("YeniMaas.xlsx")

In [10]:
# Özetle: Excel dosyasını çektik. Null değerleri attık ve yeni bir excel olarak
# -dışarı çıkardık.